Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
encoder_inputs (InputLayer)     [(None, 80)]         0                                            
__________________________________________________________________________________________________
embedding (Embedding)           (None, 80, 500)      508500      encoder_inputs[0][0]             
__________________________________________________________________________________________________
bidirectional_LSTM_1 (Bidirecti [(None, 80, 1000), ( 4004000     embedding[0][0]                  
__________________________________________________________________________________________________
dropout (Dropout)               (None, 80, 1000)     0           bidirectional_LSTM_1[0][0]       
__________________________________________________________________________________________________
bidirectional_LSTM_2 (Bidirecti [(None, 80, 1000), ( 6004000     dropout[0][0]                    
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 80, 1000)     0           bidirectional_LSTM_2[0][0]       
__________________________________________________________________________________________________
decoder_inputs (InputLayer)     [(None, None)]       0                                            
__________________________________________________________________________________________________
bidirectional_LSTM_3 (Bidirecti [(None, 80, 1000), ( 6004000     dropout_1[0][0]                  
__________________________________________________________________________________________________
embedding_1 (Embedding)         (None, None, 500)    108000      decoder_inputs[0][0]             
__________________________________________________________________________________________________
concatenate (Concatenate)       (None, 1000)         0           bidirectional_LSTM_3[0][1]       
                                                                 bidirectional_LSTM_3[0][3]       
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 1000)         0           bidirectional_LSTM_3[0][2]       
                                                                 bidirectional_LSTM_3[0][4]       
__________________________________________________________________________________________________
decoder_LSTM (LSTM)             [(None, None, 1000), 6004000     embedding_1[0][0]                
                                                                 concatenate[0][0]                
                                                                 concatenate_1[0][0]              
__________________________________________________________________________________________________
attention_layer (AttentionLayer ((None, None, 1000), 2001000     bidirectional_LSTM_3[0][0]       
                                                                 decoder_LSTM[0][0]               
__________________________________________________________________________________________________
concat_layer (Concatenate)      (None, None, 2000)   0           decoder_LSTM[0][0]               
                                                                 attention_layer[0][0]            
__________________________________________________________________________________________________
time_distributed_layer (TimeDis (None, None, 216)    432216      concat_layer[0][0]               
==================================================================================================
Total params: 25,065,716
Trainable params: 25,065,716
Non-trainable params: 0
__________________________________________________________________________________________________
